%% 参数
%  均使用国际单位制

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%     固定常量     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

e = 1.602176634e-19;            %电子的电荷量
m = 9.10956e-31;                %电子的质量
kb = 1.380649e-23;              %玻尔兹曼常数
h = 6.6260755e-34;              %普朗克常量
hbar = 1.05457266e-34;          %约化普朗克常量

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%     模型参数     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

d1 = 150 * 1e-9;                %源极长度
d2 = 20  * 1e-9;                %栅极长度
d3 = 150 * 1e-9;                %漏极长度

lightDopDensity = 1e22;         %峰值轻掺杂浓度
heavyDopDensity = 1e26;         %峰值重掺杂浓度

lightSuperElecs = 40;            %轻掺杂区域超电子数目(要求偶数)
heavySuperElecs = 640;            %重掺杂区域超电子数目(要求偶数)

T = 300;                        %环境温度

timeStart = 0;                  %时间段
timeEnd = 2.1385e-11;

NGate = 20;                     %栅极划分数，总划分数根据NGate获得

noFly = 1000;                    %需要模拟的运动次数
deltaFly = noFly/4;             %分段计算飞行过程，分段存储

nofScat = 15;                   %考虑的散射类型数
slefScatRate = 1.2;             %自散射占比

EnergyInit = 0.01*e;            %电子初始能量

gammaMax = 4e13;                %主要用来计算飞行时间，大小不计较

xsforSourceB = 9e19;

xsfornDot = 1e3;

lenEnergyRelax = 20e-9;

downlimit = 0.3;

uplimit = 1;

numofErelax = 22;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%     材料参数     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

                           % Material = 'Si'

a = 5.431e-10;                  %晶格常数
c = 3.867e-10; 
EMax = 1.3*e;                   %电子在第一导带中的最高能量
EnergyCut = downlimit*e;        %电子所能发射声子的最低能量,eV,这里的参数
                                %会导致电子可能发生停滞,因为有一些散射是弹性的
                                %所以该参数必须小于downlimit
Eg = 0.2*e;                     %导带底能量，相对于费米能级
dGX = 2*pi/a;                   %第一布里渊区，Gamma点到X点的距离
qf = 0.95*dGX;                  %f型散射声子波矢大小
qg = 0.3*dGX;                   %g型散射声子波矢大小
qintra = 0.15*dGX;              %谷内散射声子波矢大小
wMin = 0;                       %频率网格参数
wMax = 12e13;
NW = 1000;
deltaw = (wMax-wMin)/NW;
qMin = 0;                       %波矢网格参数
qMax = dGX;
NQ = 1000;
mt = 0.196*m;                   %质量张量的分量
ml = 0.916*m;
V0 = sqrt(3)*c^3/8;             %单原子体积
Rs = 2.122e-10;                 %球形Winger-Seitz元胞半径
DLA = 6.39*e;                   %各向同性平均形变势
DTA = 3.01*e;
gammaG = 0.73;                  %Gruneisen非谐参数
C44 = 75e9;
miu = C44;                      %剪切模量
rou = 2330;                     %密度
thetaD = 643;                   %德拜温度
omegaD = thetaD*kb/hbar;        %德拜频率
k = 148;                        %热导张量，暂定常数

kappa = 11.9*8.854187817e-12;   %介电常量
Beta = 1e9;                     %屏蔽长度倒数
Z = 0.02;                       %杂质电荷数

ul = 9.2e3;                     %纵向声速
ut = 4.7e3;                     %横向声速
bzR = (5/pi)^(1/3)*dGX;         %第一布里渊区等效半径
md = (mt^2*ml)^(1/3);           %态密度有效质量
gDKTA = 0.5e10*e;               %耦合常数
gDKLA = 0.8e10*e;
gDKLO =  11e10*e;
fDKTA = 0.3e10*e;
fDKLA =   2e10*e;
fDKTO =   2e10*e;


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%     其他处理     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

mLength = d1+d2+d3;             %实空间模型长度
mbLeft  = 0;                    %模拟区域边界
mbRight = mLength;
xMin = mbLeft;                  %模型网格参数
xMax = mbRight;
NX = mLength/d2*NGate;
deltax = mLength/NX;
tMin = timeStart;               %时间网格参数
tMax = timeEnd;
Nt = 100;
sumSuperElecs = lightSuperElecs+heavySuperElecs;%总的超电子数
Deltat = timeEnd-timeStart;     %模拟时间间隔
deltat = Deltat / Nt;







































