%% 参数
%  均使用国际单位制

%##################################
%############ 固定常量 ##############
%##################################

e = 1.602176634e-19;            %电子的电荷量
m = 9.10956e-31;                  %电子的质量
kb = 1.380649e-23;               %玻尔兹曼常数
h = 6.6260755e-34;               %普朗克常量
hbar = 1.05457266e-34;         %约化普朗克常量
epsilon0 = 8.854187817e-12;  %真空介电常数
epsilonSi = 11.9;

%##################################
%############ 可调参数 ##############
%##################################

DopDensity = 1e23;           %掺杂浓度

SuperElecs = 20;               %掺杂区域电子数目

T = 300;                          %环境温度

electricField = -50e5;            %电场大小，V/m

noFly = 2000;                     %需要模拟的运动次数

nofScat = 15;                   %考虑的散射类型数

EnergyInit = 0.0001*e;          %电子初始能量

EnergyMax = 2*e;

driftVelocity = 2.5e5;            %最大热运动速度

inParabolicFactor = 0.8;      %能谷非抛物线性参数

xsForimpurity = 0.1;

wMin = 0;                         %频率网格参数
wMax = 1e14;
NW = 200;

Nt = 50;

%##################################
%############ 材料参数 ##############
%##################################

% Material = 'Si'

a = 5.431e-10;                            %晶格常数
c = 3.867e-10; 
mt = 0.196*m;                            %质量张量的分量
ml = 0.916*m;
md = (mt^2*ml)^(1/3);                 %态密度有效质量
rou = 2330;                                 %密度
% 电离杂质散射所需参数
% 电子谷间散射所需参数
gDKTA = 0.5e10*e;                      %耦合常数
gDKLA = 0.8e10*e;
gDKLO =  11e10*e;
fDKTA = 0.3e10*e;
fDKLA =   2e10*e;
fDKTO =   2e10*e;
dGX = 2*pi/a;                             %第一布里渊区，Gamma点到X点的距离
bzR = (5/pi)^(1/3)*dGX;               %第一布里渊区等效半径
qf = 0.95*dGX;
qg = 0.3*dGX;

% 电子谷内散射所需参数
DLA = 6.39*e;                            %各向同性平均形变势
DTA = 3.01*e;
ul = 9.2e3;                                 %纵向声速
ut = 4.7e3;                                 %横向声速
qintra = 0.15*dGX;                       %谷内散射声子波矢大小












































